# MatchlineFailures Properties

---
The BuiltInFailuresMatchlineFailures type exposes the following members.
| Name| Description
---|---|---
| CreationFailed|  Matchline top extent should be higher than its bottom.
Top
#### Reference
BuiltInFailuresMatchlineFailures Class
Autodesk.Revit.DB Namespace